Tekla Open API Reference for Tekla Structures 2025
AnalysisConnectivity Class
 The AnalysisConnectivity class contains information related to analysis connectivities.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisConnectivity
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class AnalysisConnectivity
Public Class AnalysisConnectivity
The AnalysisConnectivity type exposes the following members.
Constructors
Name | Description
AnalysisConnectivity
Initializes a new instance of the AnalysisConnectivity class
Top
Properties
Name | Description
Connectivity
 The connectivity type of the analysis connectivity.
Spring
 The spring values of the analysis connectivity.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace